// Написать программу вычисления произведения чисел от 1 до N

int n = 10;
int b = 1;
for (int x = 0; x <= b; x++)
{
    b = b * x;
}
Console.WriteLine(b);